extra/coderz/assignment2.tex
% Created 2021-10-04 Mon 00:06
% Intended LaTeX compiler: pdflatex
\documentclass{scrartcl}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fontspec}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage[dvipsnames]{xcolor}
\usepackage[colorlinks=true, linkcolor=Blue, citecolor=BrickRed, urlcolor=PineGreen]{hyperref}
\usepackage{indentfirst}
\setmainfont[Ligatures=TeX]{Alegreya}
\setmonofont[Ligatures=TeX]{Liga SFMono Nerd Font}
% features: (acronym par-sep engraved-code-setup engraved-code)
\newcommand{\acr}[1]{\protect\textls*[110]{\scshape #1}}
\newcommand{\acrs}{\protect\scalebox{.91}[.84]\hspace{0.15ex}s}
\setlength{\parskip}{\baselineskip}
\setlength{\parindent}{0pt}


\usepackage{fvextra}
\fvset{
  commandchars=\\\{\},
  highlightcolor=white!95!black!80!blue,
  breaklines=true,
  breaksymbol=\color{white!60!black}\tiny\ensuremath{\hookrightarrow}}
\renewcommand\theFancyVerbLine{\footnotesize\color{black!40!white}\arabic{FancyVerbLine}}

\definecolor{codebackground}{HTML}{f7f7f7}
\definecolor{codeborder}{HTML}{f0f0f0}

% TODO have code boxes keep line vertical alignment
\usepackage[breakable,xparse]{tcolorbox}
\DeclareTColorBox[]{Code}{o}%
{colback=codebackground, colframe=codeborder,
  fontupper=\footnotesize,
  colupper=EFD,
  IfNoValueTF={#1}%
  {boxsep=2pt, arc=2.5pt, outer arc=2.5pt,
    boxrule=0.5pt, left=2pt}%
  {boxsep=2.5pt, arc=0pt, outer arc=0pt,
    boxrule=0pt, leftrule=1.5pt, left=0.5pt},
  right=2pt, top=1pt, bottom=0.5pt,
  breakable}

\definecolor{EFD}{HTML}{ECEFF4}
\definecolor{EfD}{HTML}{2E3440}
\newcommand{\EFD}[1]{\colorbox{EfD}{\textcolor{EFD}{#1}}} % default
\definecolor{EFk}{HTML}{81A1C1}
\newcommand{\EFk}[1]{\textcolor{EFk}{#1}} % font-lock-keyword-face
\definecolor{EFd}{HTML}{78808f}
\newcommand{\EFd}[1]{\textcolor{EFd}{#1}} % font-lock-doc-face
\definecolor{EFt}{HTML}{8FBCBB}
\newcommand{\EFt}[1]{\textcolor{EFt}{#1}} % font-lock-type-face
\definecolor{EFs}{HTML}{A3BE8C}
\newcommand{\EFs}[1]{\textcolor{EFs}{#1}} % font-lock-string-face
\definecolor{EFw}{HTML}{EBCB8B}
\newcommand{\EFw}[1]{\textcolor{EFw}{#1}} % font-lock-warning-face
\definecolor{EFb}{HTML}{81A1C1}
\newcommand{\EFb}[1]{\textcolor{EFb}{#1}} % font-lock-builtin-face
\definecolor{EFct}{HTML}{6f7787}
\newcommand{\EFct}[1]{\textcolor{EFct}{#1}} % font-lock-comment-face
\definecolor{EFc}{HTML}{81A1C1}
\newcommand{\EFc}[1]{\textcolor{EFc}{#1}} % font-lock-constant-face
\definecolor{EFpp}{HTML}{81A1C1}
\newcommand{\EFpp}[1]{\textcolor{EFpp}{\textbf{#1}}} % font-lock-preprocessor-face
\definecolor{EFnc}{HTML}{81A1C1}
\newcommand{\EFnc}[1]{\textcolor{EFnc}{\textbf{#1}}} % font-lock-negation-char-face
\definecolor{EFv}{HTML}{D8DEE9}
\newcommand{\EFv}[1]{\textcolor{EFv}{#1}} % font-lock-variable-name-face
\definecolor{EFf}{HTML}{88C0D0}
\newcommand{\EFf}[1]{\textcolor{EFf}{#1}} % font-lock-function-name-face
\definecolor{EFcd}{HTML}{6f7787}
\newcommand{\EFcd}[1]{\textcolor{EFcd}{#1}} % font-lock-comment-delimiter-face
\definecolor{EFrc}{HTML}{81A1C1}
\newcommand{\EFrc}[1]{\textcolor{EFrc}{\textbf{#1}}} % font-lock-regexp-grouping-construct
\definecolor{EFrb}{HTML}{81A1C1}
\newcommand{\EFrb}[1]{\textcolor{EFrb}{\textbf{#1}}} % font-lock-regexp-grouping-backslash
\definecolor{Efob}{HTML}{373E4C}
\newcommand{\EFob}[1]{\colorbox{Efob}{#1}} % org-block
\definecolor{EFhn}{HTML}{B48EAD}
\newcommand{\EFhn}[1]{\textcolor{EFhn}{\textbf{#1}}} % highlight-numbers-number
\definecolor{EFhq}{HTML}{81A1C1}
\newcommand{\EFhq}[1]{\textcolor{EFhq}{#1}} % highlight-quoted-quote
\definecolor{EFhs}{HTML}{8FBCBB}
\newcommand{\EFhs}[1]{\textcolor{EFhs}{#1}} % highlight-quoted-symbol
\definecolor{EFrdi}{HTML}{81A1C1}
\newcommand{\EFrdi}[1]{\textcolor{EFrdi}{#1}} % rainbow-delimiters-depth-1-face
\definecolor{EFrdii}{HTML}{B48EAD}
\newcommand{\EFrdii}[1]{\textcolor{EFrdii}{#1}} % rainbow-delimiters-depth-2-face
\definecolor{EFrdiii}{HTML}{A3BE8C}
\newcommand{\EFrdiii}[1]{\textcolor{EFrdiii}{#1}} % rainbow-delimiters-depth-3-face
\definecolor{EFrdiv}{HTML}{5D80AE}
\newcommand{\EFrdiv}[1]{\textcolor{EFrdiv}{#1}} % rainbow-delimiters-depth-4-face
\definecolor{EFrdv}{HTML}{8FBCBB}
\newcommand{\EFrdv}[1]{\textcolor{EFrdv}{#1}} % rainbow-delimiters-depth-5-face
\definecolor{EFrdvi}{HTML}{81A1C1}
\newcommand{\EFrdvi}[1]{\textcolor{EFrdvi}{#1}} % rainbow-delimiters-depth-6-face
\definecolor{EFrdvii}{HTML}{B48EAD}
\newcommand{\EFrdvii}[1]{\textcolor{EFrdvii}{#1}} % rainbow-delimiters-depth-7-face
\definecolor{EFrdiix}{HTML}{A3BE8C}
\newcommand{\EFrdiix}[1]{\textcolor{EFrdiix}{#1}} % rainbow-delimiters-depth-8-face
\definecolor{EFrdix}{HTML}{5D80AE}
\newcommand{\EFrdix}[1]{\textcolor{EFrdix}{#1}} % rainbow-delimiters-depth-9-face
% end features

%% make document follow Emacs theme

\definecolor{obg}{HTML}{2E3440}
\definecolor{ofg}{HTML}{ECEFF4}

\pagecolor{obg}
\color{ofg}

% list labels

\definecolor{itemlabel}{HTML}{81A1C1}

\renewcommand{\labelitemi}{\textcolor{itemlabel}{\textbullet}}
\renewcommand{\labelitemii}{\textcolor{itemlabel}{\normalfont\bfseries \textendash}}
\renewcommand{\labelitemiii}{\textcolor{itemlabel}{\textasteriskcentered}}
\renewcommand{\labelitemiv}{\textcolor{itemlabel}{\textperiodcentered}}

\renewcommand{\labelenumi}{\textcolor{itemlabel}{\theenumi.}}
\renewcommand{\labelenumii}{\textcolor{itemlabel}{(\theenumii)}}
\renewcommand{\labelenumiii}{\textcolor{itemlabel}{\theenumiii.}}
\renewcommand{\labelenumiv}{\textcolor{itemlabel}{\theenumiv.}}

% structural elements

\definecolor{documentTitle}{HTML}{81A1C1}
\definecolor{documentInfo}{HTML}{81A1C1}
\definecolor{level1}{HTML}{81A1C1}
\definecolor{level2}{HTML}{B48EAD}
\definecolor{level3}{HTML}{5D80AE}
\definecolor{level4}{HTML}{a0b8d0}
\definecolor{level5}{HTML}{c6aac1}
\definecolor{level6}{HTML}{c0d0e0}
\definecolor{level7}{HTML}{d9c6d6}
\definecolor{level8}{HTML}{e5ecf2}

\addtokomafont{title}{\color{documentTitle}}
\addtokomafont{author}{\color{documentInfo}}
\addtokomafont{date}{\color{documentInfo}}
\addtokomafont{section}{\color{level1}}
\newkomafont{sectionprefix}{\color{level1}}
\addtokomafont{subsection}{\color{level2}}
\newkomafont{subsectionprefix}{\color{level2}}
\addtokomafont{subsubsection}{\color{level3}}
\newkomafont{subsubsectionprefix}{\color{level3}}
\addtokomafont{paragraph}{\color{level4}}
\newkomafont{paragraphprefix}{\color{level4}}
\addtokomafont{subparagraph}{\color{level5}}
\newkomafont{subparagraphprefix}{\color{level5}}

% textual elements

\definecolor{link}{HTML}{81A1C1}
\definecolor{cite}{HTML}{98c1c0}
\definecolor{itemlabel}{HTML}{81A1C1}
\definecolor{code}{HTML}{D08770}
\definecolor{verbatim}{HTML}{A3BE8C}

\renewcommand{\labelitemi}{\textcolor{itemlabel}{\textbullet}}
\renewcommand{\labelitemii}{\textcolor{itemlabel}{\normalfont\bfseries \textendash}}
\renewcommand{\labelitemiii}{\textcolor{itemlabel}{\textasteriskcentered}}
\renewcommand{\labelitemiv}{\textcolor{itemlabel}{\textperiodcentered}}

\renewcommand{\labelenumi}{\textcolor{itemlabel}{\theenumi.}}
\renewcommand{\labelenumii}{\textcolor{itemlabel}{(\theenumii)}}
\renewcommand{\labelenumiii}{\textcolor{itemlabel}{\theenumiii.}}
\renewcommand{\labelenumiv}{\textcolor{itemlabel}{\theenumiv.}}

\DeclareTextFontCommand{\texttt}{\color{code}\ttfamily}
\makeatletter
\def\verbatim@font{\color{verbatim}\normalfont\ttfamily}
\makeatother

% code blocks

\definecolor{codebackground}{HTML}{313743}
\colorlet{EFD}{ofg}
\definecolor{codeborder}{HTML}{373d49}

%% end customisations

\author{Shaurya Singh}
\date{}
\title{CoderZ Summer Assignment \#2}
\colorlet{greenyblue}{blue!70!green}
\colorlet{blueygreen}{blue!40!green}
\providecolor{link}{named}{greenyblue}
\providecolor{cite}{named}{blueygreen}
\hypersetup{
  pdfauthor={Shaurya Singh},
  pdftitle={CoderZ Summer Assignment \#2},
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 29.0.50 (Org mode 9.5)},
  pdflang={English},
  breaklinks=true,
  colorlinks=true,
  linkcolor=,
  urlcolor=link,
  citecolor=cite
}
\urlstyle{same}
\begin{document}

\maketitle
\setcounter{tocdepth}{2}
\tableofcontents

Hello everyone! This is the second assignment you will receive this summer. By this
point, all of you should have received and submitted Assignment \#1, which had
you set up VSCode for Python programming. If you still need help, feel free to
email me at shaunsingh0207@gmail.com.

In Assignment \#2, you will learn the basics of Python 3 and how to use variables

\section{Basics}
\label{sec:org999fa5d}
Python is an interpreted programming language. You write \texttt{.py} files, in a text
editor (such as VSCode), which are interpreted by the python interpreter, and
executed. As with every language, Python has its own syntax.

Firstly, before you get started with this guide, create a \texttt{robotics1.py} file,
this is where you will be writing the examples below, and executing them

\subsection{Indentation}
\label{sec:orge43add3}
Indentation refers to the spaces at the beginning of a code line. In other
languages, you usually have brackets or parenthesis telling you where a block of
code starts and ends. For example, in java we have the following
\begin{Code}
\begin{Verbatim}[]
\color{EFD}\EFk{public} \EFk{class} \EFt{Main} \EFrdi{\{}
  \EFk{public} \EFk{static} \EFt{void} \EFf{main}\EFrdii{(}\EFt{String}\EFrdiii{[}\EFrdiii{]} \EFv{args}\EFrdii{)} \EFrdii{\{}
    System.out.println\EFrdiii{(}\EFs{"Hello World"}\EFrdiii{)};
  \EFrdii{\}}
\EFrdi{\}}
\end{Verbatim}
\end{Code}
Notice the use of \texttt{\{\}} to tell you where each part of the code starts and ends.
Instead of brackets, in python we rely on just indentation. For example, if we
want to do an if statement, we would write something like
\begin{Code}
\begin{Verbatim}[]
\color{EFD}\EFk{if} \EFhn{5} > \EFhn{2}:
  \EFk{print}(\EFs{"Five is greater than two!"})
\end{Verbatim}
\end{Code}
Notice the spaces in front of print. If we remove those spaces, and write
\begin{Code}
\begin{Verbatim}[]
\color{EFD}\EFk{if} \EFhn{5} > \EFhn{2}:
\EFk{print}(\EFs{"Five is greater than two!"})
\end{Verbatim}
\end{Code}
It will result in an error. Remember the number of spaces can be any number (I
choose 2), but it must remain the same throughout the python file.

\subsection{Comments}
\label{sec:org43308e7}
As with any language, you can (and should) be commenting your code. Comments in
python start with a \# character, which will mark the rest of the line as a comment
\begin{Code}
\begin{Verbatim}[]
\color{EFD}\EFcd{\# }\EFct{Compare 5 to 2}
\EFk{if} \EFhn{5} > \EFhn{2}:
  \EFk{print}(\EFs{"Five is greater than two!"})
\end{Verbatim}
\end{Code}
Comments can also be added to the ends of lines.
\begin{Code}
\begin{Verbatim}[]
\color{EFD}\EFk{if} \EFhn{5} > \EFhn{2}:
  \EFk{print}(\EFs{"Five is greater than two!"}) \EFcd{\# }\EFct{Compare 5 to 2}
\end{Verbatim}
\end{Code}
Lastly, you can have multiline comments if needed
\begin{Code}
\begin{Verbatim}[]
\color{EFD}\EFd{"""
Line \#1
Line \#2
"""}
\EFk{if} \EFhn{5} > \EFhn{2}:
  \EFk{print}(\EFs{"Five is greater than two!"}) \EFcd{\# }\EFct{Compare 5 to 2}
\end{Verbatim}
\end{Code}

\section{Variables}
\label{sec:org61157c0}
A variable is a term that represents an value. You can use variables for storing
information for later usage. In Python, you assign a variable a value using the
= sign. You can also assign multiple variables at once
\begin{Code}
\begin{Verbatim}[]
\color{EFD}\EFv{x} = \EFhn{5}
\EFv{y} = \EFs{"John"}
\EFv{x}, \EFv{y}, \EFv{z} = \EFs{"Orange"}, \EFs{"Banana"}, \EFs{"Grape"}
\end{Verbatim}
\end{Code}
There are also different data types that we need to be aware of. If you want to
specific the data type of a variable, you can cast it.
\begin{Code}
\begin{Verbatim}[]
\color{EFD}\EFv{x} = \EFb{str}(\EFhn{3}) \EFcd{\#}\EFct{x is a string, and will be '3'}
\EFv{y} = \EFb{int}(\EFhn{3}) \EFcd{\#}\EFct{y is a integer, and will be 3}
\EFv{z} = \EFb{float}(\EFhn{3}) \EFcd{\#}\EFct{z is a float, and will be 3.0}
\end{Verbatim}
\end{Code}
You can also get the data type of a variable, using \texttt{type()} .
\begin{Code}
\begin{Verbatim}[]
\color{EFD}\EFv{x} = \EFb{str}(\EFhn{3}) \EFcd{\#}\EFct{x is a string, and will be '3'}
\EFk{print}(\EFb{type}(x))
\end{Verbatim}
\end{Code}
Lastly, you can define values in a list and unpack them to variables later
\begin{Code}
\begin{Verbatim}[]
\color{EFD}\EFv{fruits} = [\EFs{"apple"}, \EFs{"banana"}, \EFs{"Grape"}]
\EFv{x}, \EFv{y}, \EFv{z} = fruits
\end{Verbatim}
\end{Code}
Remember that variables are case sensitive, so \texttt{John} and \texttt{john} are two different
variables. Also keep in mind you can use single quotes or double quotes. In
robotics, we prefer to write variables in the camelCase format, where each word
except the first starts with a capital letter, like \texttt{myVariableName}.

\subsection{Global Variables}
\label{sec:org675db7d}
Variables created outside of a function are called global variables. Global
variables can be used both inside of functions and outside
\begin{Code}
\begin{Verbatim}[]
\color{EFD}\EFv{x} = \EFs{"global"}
\EFk{def} \EFf{myfunc}():
    \EFk{print}(\EFs{"this variable is "} + x)
myfunc()
\end{Verbatim}
\end{Code}
In this case, the variable x is a global variable
\begin{Code}
\begin{Verbatim}[]
\color{EFD}\EFk{def} \EFf{myfunc}():
  \EFv{x} = \EFs{"global"}
  \EFk{print}(\EFs{"this variable is "} + x)

myfunc()
\EFk{print}(\EFs{"this variable is "} + x)
\end{Verbatim}
\end{Code}
In this case it isn't, and so the last print statement won't function

\section{Assignment}
\label{sec:orgadb412f}
\begin{enumerate}
\item Create a file named \texttt{assignment2.py}
\item Write some python code that defines a global variable, defines a function
that prints \texttt{Hello World} + the variable, and call that function
\end{enumerate}
\end{document}
